; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_6)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 link5 - link
    angle0 angle40 angle80 angle120 angle160 angle200 angle240 angle280 angle320 - angle)
(:init
    (AngleOrd angle0 angle40)
    (AngleOrd angle40 angle80)
    (AngleOrd angle80 angle120)
    (AngleOrd angle120 angle160)
    (AngleOrd angle160 angle200)
    (AngleOrd angle200 angle240)
    (AngleOrd angle240 angle280)
    (AngleOrd angle280 angle320)
    (AngleOrd angle320 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)
    (IsChildOf link5 link4)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)
    (Affected link4 link1)
    (Affected link4 link2)
    (Affected link4 link3)
    (Affected link5 link1)
    (Affected link5 link2)
    (Affected link5 link3)
    (Affected link5 link4)

    (HasAngle angle120 link1)
    (HasAngle angle200 link2)
    (HasAngle angle200 link3)
    (HasAngle angle280 link4)
    (HasAngle angle240 link5)
)
(:goal
(and
    (HasAngle angle200 link1)
    (HasAngle angle120 link2)
    (HasAngle angle240 link3)
    (HasAngle angle240 link4)
    (HasAngle angle280 link5)
    )
)
)

; plan
1. (increase_angle link1 angle120 angle160)
   deleted: (hasangle angle120 link1) (hasangle angle200 link2) (hasangle angle200 link3) (hasangle angle280 link4) (hasangle angle240 link5)
   added: (hasangle angle160 link1) (hasangle angle240 link2) (hasangle angle240 link3) (hasangle angle320 link4) (hasangle angle280 link5)
   goals met: 2 of 5
2. (increase_angle link1 angle160 angle200)
   deleted: (hasangle angle160 link1) (hasangle angle240 link2) (hasangle angle240 link3) (hasangle angle320 link4) (hasangle angle280 link5)
   added: (hasangle angle200 link1) (hasangle angle280 link2) (hasangle angle280 link3) (hasangle angle0 link4) (hasangle angle320 link5)
   goals met: 1 of 5
3. (decrease_angle link2 angle280 angle240)
   deleted: (hasangle angle280 link2) (hasangle angle280 link3) (hasangle angle0 link4) (hasangle angle320 link5)
   added: (hasangle angle240 link2) (hasangle angle240 link3) (hasangle angle320 link4) (hasangle angle280 link5)
   goals met: 3 of 5
4. (decrease_angle link2 angle240 angle200)
   deleted: (hasangle angle240 link2) (hasangle angle240 link3) (hasangle angle320 link4) (hasangle angle280 link5)
   added: (hasangle angle200 link2) (hasangle angle200 link3) (hasangle angle280 link4) (hasangle angle240 link5)
   goals met: 1 of 5
5. (decrease_angle link2 angle200 angle160)
   deleted: (hasangle angle200 link2) (hasangle angle200 link3) (hasangle angle280 link4) (hasangle angle240 link5)
   added: (hasangle angle160 link2) (hasangle angle160 link3) (hasangle angle240 link4) (hasangle angle200 link5)
   goals met: 2 of 5
6. (decrease_angle link2 angle160 angle120)
   deleted: (hasangle angle160 link2) (hasangle angle160 link3) (hasangle angle240 link4) (hasangle angle200 link5)
   added: (hasangle angle120 link2) (hasangle angle120 link3) (hasangle angle200 link4) (hasangle angle160 link5)
   goals met: 2 of 5
7. (increase_angle link3 angle120 angle160)
   deleted: (hasangle angle120 link3) (hasangle angle200 link4) (hasangle angle160 link5)
   added: (hasangle angle160 link3) (hasangle angle240 link4) (hasangle angle200 link5)
   goals met: 3 of 5
8. (increase_angle link3 angle160 angle200)
   deleted: (hasangle angle160 link3) (hasangle angle240 link4) (hasangle angle200 link5)
   added: (hasangle angle200 link3) (hasangle angle280 link4) (hasangle angle240 link5)
   goals met: 2 of 5
9. (increase_angle link3 angle200 angle240)
   deleted: (hasangle angle200 link3) (hasangle angle280 link4) (hasangle angle240 link5)
   added: (hasangle angle240 link3) (hasangle angle320 link4) (hasangle angle280 link5)
   goals met: 4 of 5
10. (decrease_angle link4 angle320 angle280)
   deleted: (hasangle angle320 link4) (hasangle angle280 link5)
   added: (hasangle angle280 link4) (hasangle angle240 link5)
   goals met: 3 of 5
11. (decrease_angle link4 angle280 angle240)
   deleted: (hasangle angle280 link4) (hasangle angle240 link5)
   added: (hasangle angle240 link4) (hasangle angle200 link5)
   goals met: 4 of 5
12. (increase_angle link5 angle200 angle240)
   deleted: (hasangle angle200 link5)
   added: (hasangle angle240 link5)
   goals met: 4 of 5
13. (increase_angle link5 angle240 angle280)
   deleted: (hasangle angle240 link5)
   added: (hasangle angle280 link5)
   goals met: 5 of 5
